homework/app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.all
---
SELECT "theaters".* FROM "theaters"

  def show
    @theaters = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 0 LIMIT 1

  def create
    m = Theater.new
    m.name = params[:name]
    m.address = params[:address]
    m.phone_number = params[:phone_number]
    m.save
---
INSERT INTO "theaters" ("address", "name", "phone_number") VALUES (?, ?, ?)  [["address", nil], ["name", nil], ["phone_number", "2421r1"]]

  def edit
    @theaters = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1

  def destroy
    m = Theater.find_by_id(params[:id])
    m.destroy
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 3 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 3]]